/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Cannot Complete Action";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Try again later.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "This media format is not supported.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "This media may be damaged.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "This app is not authorized to play this file."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "This media cannot be used.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Cannot Decode";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "The decoder required for this media is busy.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Stop any other actions that decode media and try again.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "The media cannot be used on this computer.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Cannot open";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "The content cannot be played on the external display.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Cannot open";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "The protected content cannot be played in the current system configuartion.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "Transcode output video track has incorrect frame count";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Transcode output frame count is not equal to source which has no edit segments";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Failed to decode";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "decoder encountered an error";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Failed to encode";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "encoder encountered an error";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_Description" = "Provided offline Key is Invalid";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_FailureReason" = "Offline Key provided may be invalid or persistent key storage directory not found";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_FailureReason" = "This computer is not authorized to play the content";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_FailureReason" = "This app is not authorized to play protected content";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_Description" = "Cannot Open";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_FailureReason" = "This content is no longer available";
